"""🐀 Напишите программу на Python, которая будет находить
сумму элементов массива из 1000000 целых чисел.
🐀 Пример массива: arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, ...]
🐀 Массив должен быть заполнен случайными целыми числами
от 1 до 100.
🐀 При решении задачи нужно использовать многопоточность,
многопроцессорность и асинхронность.
🐀 В каждом решении нужно вывести время выполнения
вычислений."""

from multiprocessing import Process, Pool
from random import randint
from task7_map_red import array_num




print(array_num)

